app/Repositories/Eloquent/DocumentRepository.php

    public function getAllDocuments(int $perPage = 10): LengthAwarePaginator
    {
        return Document::orderBy('updated_at', 'desc')->paginate($perPage);
---
select * from `documents` order by `updated_at` desc limit 10 offset 0
select count(*) as aggregate from `documents`

    public function getDocumentById(int $id): ?Document
    {
        return Document::find($id);
---
select * from `documents` where `documents`.`id` = 1 limit 1

    public function createDocument(array $data): Document
    {
        return Document::create($data);
---
insert into `documents` (`title`, `description`, `file`, `updated_at`, `created_at`) values ('đấ', 'dâdad', 'documents/hIHYNjev9fJibRwkbopNe7HRkXZe6sNOMcMdXnRh.docx', '2025-06-10 14:32:59', '2025-06-10 14:32:59')

    public function updateDocument(int $id, array $data): bool
    {
        $document = $this->getDocumentById($id);
        if (!$document) {
            return false;
        }
        return $document->update($data);
---
update `documents` set `title` = 'Tài liệu 1', `documents`.`updated_at` = '2025-06-11 03:32:29' where `id` = 1