app/Repositories/Eloquent/InternshipRepository.php

    public function getAllInternships(): LengthAwarePaginator
    {
        return $this->model->with(['student', 'company', 'lecturer'])->paginate(10);
---
select * from `lecturers` where `lecturers`.`id` in (1, 2, 3, 5, 8, 9, 10)
select * from `students` where `students`.`id` in (3, 7, 13, 19, 20, 22, 23, 24, 27)