app/Repositories/Eloquent/LecturerRepository.php

    public function getDepartments(): Collection
    {
        return Department::all();
---
select * from `departments`