app/Repositories/Eloquent/ProjectRepository.php

select * from `lecturers` where `lecturers`.`id` in (1, 4, 5, 7, 8, 9, 10)
select * from `students` where `students`.`id` in (2, 10, 11, 13, 14, 15, 16, 26, 27)
---
    public function getAllWithRelations(array $filters = [], int $perPage = 10): LengthAwarePaginator
    {
        $query = $this->model->with(['student', 'lecturer']);

        if (!empty($filters['search'])) {
            $query->where('name', 'like', '%' . $filters['search'] . '%');
        }

        if (!empty($filters['status'])) {
            $query->where('status', $filters['status']);
        }

        return $query->paginate($perPage);