app/Repositories/Eloquent/StatisticsRepository.php

    public function getStatisticsByMajor(): Collection
    {
        return Project::join('students', 'projects.student_id', '=', 'students.id')
            ->select('students.major', DB::raw('count(*) as total'))
            ->groupBy('students.major')
            ->get();
---
select `students`.`major`, count(*) as total from `projects` inner join `students` on `projects`.`student_id` = `students`.`id` group by `students`.`major`

    public function getStatisticsByLecturer(): Collection
    {
        return Project::join('lecturers', 'projects.instructor_id', '=', 'lecturers.id')
            ->select('lecturers.full_name as lecturer_name', DB::raw('count(*) as total_students'))
            ->groupBy('lecturers.id', 'lecturers.full_name')
            ->get();
---
select `lecturers`.`full_name` as `lecturer_name`, count(*) as total_students from `projects` inner join `lecturers` on `projects`.`instructor_id` = `lecturers`.`id` group by `lecturers`.`id`, `lecturers`.`full_name`

    public function getStatisticsByStatus(): Collection
    {
        return Project::selectRaw('status, count(*) as total')
            ->groupBy('status')
            ->get();
---
select status, count(*) as total from `projects` group by `status`

    public function getProjectCount(): int
    {
        return Project::count();
---
select count(*) as aggregate from `projects`

    public function getInternshipCount(): int
    {
        return Internship::count();
---
select count(*) as aggregate from `internships`