app/Repositories/Eloquent/TopicRepository.php

select * from `lecturers` where `lecturers`.`id` in (1, 2, 4, 6, 7, 9)
---
    public function getTopicsWithRelations(int $perPage = 10): LengthAwarePaginator
    {
        return $this->model->with('lecturer')->paginate($perPage);