app/Http/Controllers/InternshipController.php

    public function edit(Internship $internship)
    {
        if (!Gate::allows('giangvien') && !Gate::allows('quantri')) {
            abort(403, 'Bạn không có quyền chỉnh sửa.');
        }

        $students = Student::all();
        $companies = InternshipCompany::all();
        $lecturers = Lecturer::all();
---
select * from `internship_companies`
select * from `lecturers`