app/Http/Controllers/TopicController.php

    public function show($id)
    {
        $topic = Topic::findOrFail($id);
---
select * from `topics` where `topics`.`id` = '1' limit 1

    public function edit($id)
    {
        if (!Gate::allows('giangvien') && !Gate::allows('quantri')) {
            abort(403, 'Bạn không có quyền chỉnh sửa đề tài.');
        }

        $topic = Topic::findOrFail($id);
        $lecturers = Lecturer::all();
---
select * from `topics` where `topics`.`id` = '1' limit 1
select * from `lecturers`